<template>
	<section
		class="bg-custom-dark/80 flex flex-col bg-fixed min-h-screen bg-blend-multiply bg-cover bg-center mt-20"
		:style="bgUrl('about-us.webp')"
	>
		<BaseContainer>
			<BaseTitle :darken="false">
				Edisson Group
			</BaseTitle>
			<p class="text-slate-100 text-lg md:text-xl">
				Edisson Group - современная компания, представляющая собой конгломератный холдинг, осуществляющий свою деятельность на территории России и стран ближнего зарубежья. Холдинг объединяет в себе целый ряд успешных бизнес-направлений, и имеет развитую сеть представительств. Приоритетные направления деятельности Edisson Group включают производство строительных материалов и архитектурных дизайнерских решений для экстерьера и интерьера домов и зданий, производство изделий из бетона, ландшафтный дизайн, строительно-монтажные работы. Edisson Group - была организована группой профессионалов с многолетним опытом работы в сфере производства и реализации строительной продукции. Ей удалось выйти на лидирующие позиции в производстве термопанелей, архитектурного декора для экстерьера и интерьера домов и зданий, ландшафтного дизайна.
			</p>
			<p class="text-slate-100 text-lg mt-4 md:text-xl md:mt-8">
				Струтурированно о деятельности компании:
			</p>
			<ol class="text-slate-100 list-disc list-inside text-lg space-y-2 mt-4 md:text-xl md:mt-8 md:space-y-4 pb-20">
				<li>Производим и реализуем продукцию, а также осуществляем монтаж нашей продукции, следуя самым высоким стандартам качества.</li>
				<li>В производстве мы используем только лучшее сырьё российских и зарубежных производителей.</li>
				<li>Наша цель — сделать современные технологии и материалы доступными для людей, мечтающих украсить интерьер или фасад своего дома.</li>
				<li>Мы постоянно ведём поиск новых перспективных материалов и защитных покрытий, совершенствуя технологии их нанесения на различные подложки.</li>
				<li>Будем рады сотрудничеству с архитекторами, дизайнерами, отделочниками, а также со всеми заинтересованными людьми и организациями.</li>
			</ol>
		</BaseContainer>
	</section>
</template>

<script>
export default {
	name: "AboutPage"
}
</script>

<script setup>
import bgUrl from '@/utilities/bgUrl';

</script>

<style lang="scss" scoped>

</style>