<template>
	<section class="bg-slate-100 pb-24 md:pb-32">
		<BaseContainer class="flex flex-col">
			<BaseTitle>
				Часто задаваемые вопросы
			</BaseTitle>
			<div class="space-y-12 md:space-y-16">
				<BasePopup
					v-for="answer in answers"
					:key="answer.id"
					:title="answer.title"
					:content="answer.content"
				/>
			</div>
		</BaseContainer>
	</section>
</template>

<script>
	export default {
		name: "AnswersSection",
	}
</script>

<script setup>
const answers = [
	{ id: 1, title: "Сколько кирпича заменяет термопанель?", content: "Если сравнивать материалы по теплоизолирующим свойствам, то ТЕРМОПАНЕЛЬ \"EDISSON GROUP\" c утеплителем толщиной 50 мм (λ=0,034 Вт/м2°C) заменит 1280 мм кладки на теплоизоляционном растворе из кирпича полнотелого одинарного (λ=0,82 Вт/м2°C).  В среднем по теплоизоляционным свойствам 1 см термопанели заменяет 25 см кирпичной кладки, но следует помнить — для каждого отдельного вида кирпича (силикатный, керамический, клинкерный) это сравнение будет разным." },
	{ id: 2, title: "Какие преимущества имеют термопанели перед другими способами утепления?", content: "Термопанели имеют несколько преимуществ перед другими способами утепления: улучшенная теплоизоляция, легкая установка, возможность сохранения пространства внутри помещения и эстетически привлекательный внешний вид." },
	{ id: 3, title: "Могут ли термопанели использоваться для утепления как внутренних, так и внешних стен?", content: "Да, термопанели могут использоваться как для утепления внутренних стен, так и для утепления внешних стен. Их конструкция и материалы обеспечивают высокую эффективность в сохранении тепла и защите от холода как внутри помещения, так и за его пределами. Это позволяет снизить энергозатраты для отопления и кондиционирования внутреннего пространства и создать более комфортные условия жизни или работы. Термопанели являются популярным выбором среди владельцев домов и коммерческих зданий, так как они обеспечивают эффективное утепление как внутри, так и снаружи здания." },
	{ id: 4, title: "Можно ли самостоятельно установить термопанели или требуется профессиональная помощь?", content: "Установка термопанелей может потребовать профессиональной помощи. Это связано с необходимостью правильного подготовительного шага, точного расчета и планирования процедуры монтажа, а также использования специализированных инструментов и навыков. Однако, в зависимости от сложности проекта и уровня собственных навыков, в некоторых случаях возможно самостоятельное установление термопанелей с достаточной подготовкой и исследованием инструкций производителя. Важно учитывать, что неправильно установленные термопанели могут привести к потере их эффективности и негативно повлиять на утепление стен." },
	{ id: 5, title: "Могут ли термопанели быть окрашены в любой цвет?", content: "Да, наши термопанели могут быть окрашены в широкий спектр цветов, чтобы соответствовать вашим дизайнерским предпочтениям. Мы предлагаем большой выбор стандартных цветов, которые вы можете выбрать из нашего каталога. Кроме того, мы также предлагаем услугу заказа термопанелей в специальном цвете по вашему индивидуальному запросу. Таким образом, вы можете получить термопанели, точно соответствующие вашим потребностям и желаемому дизайну. Мы готовы помочь вам в выборе цвета и предоставить подробную информацию о процессе окрашивания, чтобы достичь оптимального результата." },
];

</script>

<style lang="scss" scoped>

</style>